# PhaseArrayIterator Class

---
An iterator to a phase array.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPhaseArrayIterator
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public abstract class PhaseArrayIterator : APIObject,
    	IEnumerator

    Public MustInherit Class PhaseArrayIterator
    	Inherits APIObject
    	Implements IEnumerator

    public ref class PhaseArrayIterator abstract : public APIObject,
    	IEnumerator

    [<AbstractClassAttribute>]
    type PhaseArrayIterator =
        class
            inherit APIObject
            interface IEnumerator
        end
The PhaseArrayIterator type exposes the following members.
| Name| Description
---|---|---
| PhaseArrayIterator| For Internal Use Only.
Top
| Name| Description
---|---|---
| Current| Retrieves the item that is the current focus of the iterator.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| MoveNext| Move the iterator one item forward.
| Reset| Bring the iterator back to the start of the array.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace